### SYSTEM ###
# Arch Linux
arch-install-scripts

# Partitioning Tool
util-linux
gptfdisk
parted

# Filesystem Support(VFAT,exFAT,NTFS,ext234)
dosfstools
exfat-utils
ntfs-3g
e2fsprogs

# Character Code(filename)
convmv

# Data Compression(zip,unzip,unar/lsar,7z)
zip
unzip
unarchiver
p7zip

# Display system Information
screenfetch

### DRIVER ###
# Video(lspci | grep -e VGA -e 3D)(OpenGL)
mesa

# Sound
alsa-utils
alsa-firmware

### SHELL ###
# ZSH
zsh 
zsh-syntax-highlighting

### X WINDOW SYSTEM ###
# X [Group]
xorg
# X Server , X Utility [Group]
xorg-server
xorg-apps
# Terminal
xterm
# Xresources
xorg-xrdb
# KeyMap Utility(xmodmap -pke >~/.Xmodmap)
xorg-xmodmap
# Get Window ID(xwininfo)
xorg-xwininfo
# Get Device ID
xorg-xinput
# Backlight Utility
xorg-xbacklight
# Display Power Management
xorg-xset

# Xinitrc(startx)
xorg-xinit

# Terminal
rxvt-unicode

### DESKTOP ###
# Composit Manager/Transset Utility
xcompmgr
transset-df

# Launcher
dmenu

# Window Manager
xmonad
xmonad-contrib

# Statusbar + Get System Information
dzen2
conky
#xmobar

# img viwer + Set Wallpaper
feh

# Screen Lock
slock

### KEYBOARD ###
# Keybind Utility
xbindkeys

# Input method Framework
fcitx-im
#uim

# Input System
fcitx-mozc
#anthy

### Font ###
# Fira Code
otf-fira-code
ttf-fira-code

# EN moji
ttf-dejavu

# JP moji
otf-ipafont

# Emoji
ttf-symbola
noto-fonts-emoji

### BROWSER ###
# File Manager
thunar
tumbler

# Movie Player
mplayer
gnome-mplayer

# Web Search(GUI)
w3m
firefox
#firefox-i18n-ja
#flashplugin

### TOOL ###
# Editor
vim
leafpad

# Display AC
upower

# Screenshot              
scrot

# Screencast
simplescreenrecorder

# Edit img
imagemagick
graphicsmagick

# PDF(pdftotext,mupdf)
xpdf
mupdf

# Office Suite
libreoffice-still
#libreoffice-still-ja
#libreoffice-fresh
#libreoffice-fresh-ja
#antiword
unoconv

### PROGRAMMING ###
# Java
jdk8-openjdk

# C#
mono

# Python
python

### JOKE ###
# SL(sl -alFc)(https://github.com/mtoyoda/sl)
sl
