# ------ SYSTEM ------
# --- Arch Linux
arch-install-scripts
# --- Process Management
lsof
# --- Partitioning Tool
util-linux
gptfdisk
parted
# --- Filesystem Support
# VFAT,exFAT,NTFS,ext234
dosfstools
exfat-utils
ntfs-3g
e2fsprogs
# --- Character Code
# filename
convmv
# --- Data Compression
# zip,unzip,unar/lsar,7z
zip
unzip
unarchiver
p7zip
# --- Display system Information
screenfetch
# --- Virtualization
docker

# ------ DRIVER ------
# --- Video
# $ lspci | grep -e VGA -e 3D(OpenGL)
mesa
# --- Sound
alsa-utils
alsa-firmware

# ------ DEVICE ------
# Keyboard
teensy-loader-cli

# ------ SHELL ------
# --- command
# Magnificent app which corrects your previous console command.
# https://github.com/nvbn/thefuck
thefuck

# ------ X WINDOW SYSTEM ------
# --- Xorg Group
# Group
xorg
xorg-server
xorg-apps
# Terminal
xterm
# Xresources
xorg-xrdb
# KeyMap Utility
# $ xmodmap -pke >~/.Xmodmap
xorg-xmodmap
# Get Window ID
# $ xwininfo
xorg-xwininfo
# Get Device ID
xorg-xinput
# Backlight Utility
xorg-xbacklight
# Display Power Management
xorg-xset
# --- X standalone
# Xinitrc
# $ startx
xorg-xinit
# Terminal
rxvt-unicode

# ------ DESKTOP ------
# --- Composit Manager
# Transset Utility
xcompmgr
transset-df
# --- Launcher
dmenu
rofi
# --- Window Manager
xmonad
xmonad-contrib
# --- Statusbar
# Get/Show System Information
dzen2
conky
#xmobar
# --- img
# img viwer + Set Wallpaper
feh
# --- Screen Lock
slock

# ------ KEYBOARD ------
# --- Keybind Utility
xbindkeys
# --- Input method Framework
fcitx-im
#uim
# --- Input System
fcitx-mozc
#anthy

# ------ FONT ------
# --- Fira Code
otf-fira-code
ttf-fira-code
# --- EN moji
ttf-dejavu
# --- JP moji
otf-ipafont
# --- Emoji
noto-fonts-emoji

# ------ BROWSER  ------
# --- File Manager(GUI)
thunar
tumbler
# --- File Manager(ranger)
ranger
# source highlight
highlight
# html preview
lynx
elinks
# image preview
w3m
# movie preview(ranger/scope.sh)
ffmpegthumbnailer
# movie,audio's info preview
mediainfo
# pdf preview(ranger/scope.sh)
# $ pdftoppm
poppler
# compression
atool
bzip2
cpio
gzip
lhasa
xz
lzop
p7zip
tar
unace
unrar
zip
unzip
# --- Web Search(GUI)
w3m
firefox
#firefox-i18n-ja
#flashplugin
chromium

# ------ OTHER TOOL ------
# --- Editor
leafpad
# --- Display AC
upower
# --- Screenshot
scrot
# --- Screencast
simplescreenrecorder
# --- Edit
# img
imagemagick
graphicsmagick
# --- pdf
# $ pdftotext , evince
xpdf
evince
# --- Office Suite
libreoffice-still
#libreoffice-still-ja
#libreoffice-fresh
#libreoffice-fresh-ja
#antiword
unoconv

# ------ PROGRAMMING ------
# --- Java
jdk8-openjdk
# --- C#
mono
# --- Python
python
# lint
# flake8(http://flake8.pycqa.org/en/latest/)
flake8
# --- Rust
rust
# Rust code completion and navigation
rust-racer
# --- Ruby
ruby

# ------ JOKE ------
# --- SL
# $ sl -alFc
# https://github.com/mtoyoda/sl
sl
