### SYSTEM ###
# Arch Linux Auto Setup Tool
arch-install-scripts

# Partitioning Tool
util-linux
gptfdisk
parted

# Filesystem Support(VFAT,exFAT,NTFS,ext234)
dosfstools
exfat-utils
ntfs-3g
e2fsprogs

# zip/uzip
zip
unzip

# Display system Information
screenfetch

### SHELL ###
# ZSH(Syntax-hilight)
zsh 
zsh-syntax-highlighting

### DRIVER ###
# Video
xf86-video-vesa
xf86-video-ati
xf86-video-intel
xf86-video-nouveau 

# Sound(alsamixer)
alsa-utils

### X WINDOW SYSTEM ###
# X Server , X Utility(Group)
xorg-server
xorg-apps

# Xresources
xorg-xrdb

# Xinitrc
xorg-xinit

# Backlight Utility
xorg-xbacklight

# Display Power Management
xorg-xset

# Get window ID(xwininfo -> click)
xorg-xwininfo

### DESKTOP ###
# Terminal
xterm

# Window Manager
xmonad
xmonad-contrib

# Status bar
xmobar

# Apps Launcher
dmenu

# Screen Lock
slock

# Composit Manager/Transset Utility
xcompmgr
transset-df

# Set Wallpaper + img viwer
feh

### KEYBOARD ###
# KeyMap Utility(xmodmap -pke > ~/.Xmodmap)
xorg-xmodmap

# Keybind Utility(xbindkeys)
xbindkeys

# Input method Framework
uim

# Input System
anthy

### Font ###
# EN moji
ttf-dejavu

# JP moji
otf-ipafont

# emoji
ttf-symbola
noto-fonts-emoji

### BROWSER ###
# file Manager/Display thumbnail
thunar
tumbler

# Movie Player
mplayer

# firefox/WebBrowser/JPFont/FlashPlugin
firefox
firefox-i18n-ja
flashplugin

### TOOL ###
# Memo
leafpad

# Libreoffice/JPFontUI
libreoffice-fresh
libreoffice-fresh-ja

# Screen shot              
scrot

# Screen cast
simplescreenrecorder

# Make Gif
graphicsmagick

### PROGRAMMING ###
# Java OpenJDK8
jdk8-openjdk

# C#
mono
